# ラボ 1 - 演習 1 - セキュリティ オペレーション センター

## 演習の概要

Contoso には、企業全体のセキュリティ インシデントを監視して対応する セキュリティ オペレーション センター (SOC) があります。 SOC には、セキュリティ アナリスト、セキュリティ エンジニア、ネットワーク エンジニアが配置されています。 SOC は、セキュリティ情報イベント管理 (SIEM) ソリューションとして Microsoft Sentinel を使用することを決定しました。 企業全体からセキュリティ ログを収集して分析するために、SOC には Log Analytics ワークスペースがあります。 SOC には、最小特権の原則に基づいて、Log Analytics ワークスペースへのアクセスをセキュリティで保護する必要があります。 SOC には、セキュリティ アナリストとセキュリティ エンジニアという 2 つの異なるロールがあり、アクセス許可の要件が異なります。 ネットワーク チームは、Cisco Umbrella ログにのみアクセスする必要があります。

## パート 1: ソリューションを設計する (必須)

このタスクでは、Contoso のセキュリティ オペレーション センターに対する特定のアクセス許可を持つセキュリティ イベントを監視して対応するための概念を設計します。

### 設計アプローチ

最初の手順では、説明されているシナリオに基づいて要件を分析し、目的を理解し、要件を定義します。

提供されるユース ケースに基づいて、次の要件を概説できます。

- SIEM/SOAR ソリューションをデプロイする
- 特定の SOC ロールへのアクセスを制限する
- インシデントとそのアラートのカスタム ビューを含むダッシュボードを作成する

このシナリオでは、Microsoft Sentinel に基づいて SIEM SOAR ソリューションをデプロイし、ワークスペース コンテキストでロールベースのアクセス制御を設定し、ネットワーク チームのアクセスを Log Analytics ワークスペース内の 1 つのテーブルに制限します。 ブックを使用すると、セキュリティ アナリストと管理者は、グラフィカルな表示を使用してセキュリティ データを可視化できます。 ダッシュボードでデータを表示および分析するためのツールが用意されています。

### 提案されるソリューション

| 要件 | 解決策 | 行動計画 |
| ---- | ---- | ---- |
| SIEM/SOAR ソリューションをデプロイする | Microsoft Sentinel、Log Analytics ワークスペース | Log Analytics ワークスペースを設定し、Microsoft Sentinel をデプロイする |
| 特定の SOC ロールへのアクセスを制限する | Log Analytics ワークスペース、ロールベースのアクセス制御 | Log Analytics ワークスペース用に RBAC を設定する |
| インシデントとそのアラートのカスタム ビューを含むダッシュボードを作成する | Microsoft Sentinel、ブック | 現在のインシデントとアラートに関するカスタム ビューを含むブックを作成する |

## パート 2: ソリューションを実施する (オプション)

### タスク 1 - Log Analytics ワークスペースを作成する

このタスクでは、検出と分析のために Microsoft Sentinel によって取り込まれて使用されるすべてのデータを収容するために必要な Log Analytics ワークスペースを作成します。

1. Client 1 VM (LON-CL1) に **lon-cl1\admin** アカウントでログインします。 パスワードは、ラボ ホスティング プロバイダーから支給されます。
2. **Microsoft Edge** を開き、アドレス バーを選択し、**https://portal.azure.com** に移動し、ユーザー **User1-*******@LODSUATMCA.onmicrosoft.com** として Azure portal にログインします (****** はラボ ホスティング プロバイダーによって提供された固有のテナント ID)。 ユーザーのパスワードは、ラボ ホスティング プロバイダーから支給されます。
3. [サインインの状態を維持しますか?] ダイアログボックスで、[今後このメッセージを表示しない] チェックボックスを選択し、**[いいえ]** を選択します。
4. [いいえ] を選択して下部で表示されるパスワード保存のダイアログを閉じ、ご利用のブラウザー内で既存のグローバル管理者の認証情報が保存されないようにします。
5. Microsoft Azure へようこその画面で、[Cancel] を選択します。
6. **[リソースの作成]** を選択し、**Log Analytics ワークスペース**を検索します。
7. **Log Analytics ワークスペース タイル**を検索して、**[作成]** を選択します。
8. Log Analytics ワークスペースの作成サイトで、新しい**リソース グループ**を作成し、**rg_eastus_soc** という名前を付けます。
9. [インスタンスの詳細] に名前 **law-sentinel** を入力し、リージョンに **[米国東部]** を選択します。
10. **[確認と作成]** を選択します
11. **[作成]** を選択してデプロイを開始します。

Sentinel デプロイ用の Log Analytics ワークスペースが正常に作成されました。

### タスク 2 - Sentinel を作成する

このタスクでは、作成した Log Analytics ワークスペースに Sentinel を追加し、デモ ログを追加します。デモ テナントでは Log Analytics ワークスペースに既存のデータがないので、デモ ログをインポートして、Sentinel のしくみをよく理解します。

1. 引き続き Azure portal **https://portal.azure.com** にログインする必要があります。
2. **[リソースの作成]** を選択して、**Microsoft Sentinel** を検索し、**製品の種類: Azure サービス** を対象にフィルター処理します。
3. **Microsoft Sentinel タイル**を検索して、**[作成]** を選択します。
4. **[追加** を選択し、以前に作成した Log Analytics ワークスペース **law-sentinel** を検索します。
5. **[追加]** をクリックして確認します。
6. 左側のナビゲーション ウィンドウで、**[コンテンツ ハブ]** を選択します。
7. **Microsoft Sentinel トレーニング ラボ**を検索し、ソリューションを**選択**し**インストール**します。
8. **［作成］** を選択します
9. リソース グループ **rg_eastus_soc** とワークスペース **law-sentinel** を選びます。
10. **[確認と作成]** を選択します。
11. デプロイの**作成**を確認します。
12. ソリューションが正常にインストールされるまで待機します。

Log Analytics ワークスペースに Sentinel が正常にデプロイされ、データが追加されました。 

### タスク 3 - RBAC をセットアップする

最小限の特権に基づいてアクセスを保護する必要があります。特定のロール要件に合うロールの割り当てを作成します。 今度の生産性の高いデプロイでは、セキュリティ オペレーション センター に 2 つの異なるロールがあります。
さらに、ネットワーク チームは Cisco Umbrella ログにアクセスする必要があります。 ネットワーク チームがこれらのログにのみアクセスできるようにする必要があります。

#### アクセス許可の要件

| ロール | アクセス許可 |
|---|---|
| セキュリティ アナリスト | データ、インシデント、ブック、その他の Sentinel リソースを表示する |
| | インシデントの割り当て/無視。 |
| セキュリティ エンジニア | ブックと分析ルールを作成および編集する |
| | コンテンツ ハブからソリューションをインストールおよび更新する |
| ネットワーク チーム | テーブル **Cisco_Umbrella_dns_CL** 上のグループ **NOC** の読み取りアクセス許可|

---

1. 引き続き Azure portal **https://portal.azure.com** にログインする必要があります。
2. 上部の検索バーで、**リソース グループ**を検索し、以前に作成したリソース グループ **rg_eastus_soc** を選択します。
3. 左側のナビゲーション ウィンドウで **[アクセス制御 (IAM)]** を選択します。
4. ドロップダウン メニューから **[追加]** を選択し、**[ロールの割り当ての追加]** を選択します。
5. **Microsoft Sentinel レスポンダー**を検索し、[詳細] 列で **[表示]** を選択します。
6. アクセス許可が要件に一致していることを確認します。
7. 右上隅の **[X]** でウィンドウを閉じます。
8. [**次へ**] を選択します。
9. **[+メンバーの選択]** を選択します。
10. **SOC アナリスト** グループを検索し、ロールの割り当てを追加します。
11. **[レビューと割り当て]** を選択します。
12. ドロップダウン メニューから **[追加]** を選択し、**[ロールの割り当ての追加]** を選択します。
13. **Microsoft Sentinel 共同作成者**を検索して、そのロールを選択します。
14. [**次へ**] を選択します。
15. **[+メンバーの選択]** を選択します。
16. **[メンバーの選択]** ブレードで、ロ**SOC エンジニア** グループを検索し、ロールの割り当てを**選択**します。
17. **[レビュー + 割り当て]** をもう一度選択します
18. **[ロールの割り当て]** タブを選択し、ロールの割り当てが設定されていることを確認します。
19. ドロップダウン メニューから **[追加]** を選択し、**[カスタム役割の追加]** を選択します。
20. 「**NOC-CiscoUmbrellaCL-Read**」という名前を付けます。
21. **[ベースラインのアクセス許可]** で、**[最初から行う]** を選択します。
22. [**次へ**] を選択します。
23. **[アクセス許可]** タブで、**[アクセス許可の追加]** を選択します
24. **Microsoft.OperationalInsights** を検索し、**Azure Log Analytics** カードを選択します。
25. 次のアクセス許可を追加します。

```
Microsoft.OperationalInsights/workspaces
Read : Get Workspace
Other : Search Workspace Data

Microsoft.OperationalInsights/workspaces/analytics
Other : Search 

Microsoft.OperationalInsights/workspaces/query
Read : Query Data in Workspace 

Microsoft.OperationalInsights/workspaces/tables/query
Read : Query workspace table data 
```

26.  **[確認および作成]** を選択します。
27. **［作成］** を選択します
28. 上部の検索バーで、**リソース グループ** を検索し、**rg_eastus_soc** を選択します。
29. Log Analytics ワークスペース **law-sentinel** を開きます。
30. 左側のナビゲーション ウィンドウで、**[設定]** を展開して **[テーブル]** を選択します。
31. **Cisco_Umbrella_dns_CL** を検索します。
32. 省略記号 (...) をクリックし、**[アクセス制御 (IAM)]** を選択します。
33. **[追加]** > **  [ロール割り当ての追加]** の順に選択します。
34. **NOC-CiscoUmbrellaCL-Read** を検索し、カスタム ロールを選択します。
35. [次へ] を選択します。
36. **[メンバーの選択]** を選択し、NOC を検索してグループを**選択**します。
37. **[レビューと割り当て]** を選択します。

Contoso のセキュリティ運用チームのロール要件に対するロール ベースのアクセス モデルを正常に作成し、ネットワーク チームのカスタム ロールを作成し、Log Analytics ワークスペースの特定のテーブルにロールを割り当てました。

### タスク 4:ブックを作成する

このタスクでは、ブックを作成して、カスタム ビューと現在のインシデントとそのアラートを含むダッシュボードを取得します。

1. 引き続き Azure portal **https://portal.azure.com** にログインする必要があります。
2. 上部の検索バーで、**Microsoft Sentinel** を検索して開きます。
3. **law-sentinel** を選択します。
4. 左側のナビゲーション ウィンドウで、**[脅威の管理]** を展開して **[ブック]** を選択します。
5. **[ブックの追加]** を選択します。
6. **編集**を選択します。
7. 右側にある最初の **[編集]** ボタンを選択します。
8. **[追加]** > **[パラメーターの追加]** の順に選びます。
9.  **[パラメーターの追加]** を選び、次の情報を入力します。
 - **パラメーター名:** TimeRange
 - **パラメーターの種類:** 時間の範囲ピッカー
10. 次の設定を確認してください。
 - **必須**
11. **[保存]** を選択します。
12. 左下の **TimeRange:** ドロップダウン メニューで、**[過去 7 日間]** を選択します。
13. **[パラメーターの追加]** を選び、次の情報を入力します。
 - **パラメーター名:** AlertSeverity
 - **パラメーターの種類:** ドロップダウン
14. 次の設定を確認してください。
 - **必須**
 - **Allow multiple selections (複数選択を許可する)**
 - **Hide parameter in reading mode (閲覧モードでパラメーターを非表示にする)**
15. **Log Analytics ワークスペースの [ログ クエリ]** で、次を貼り付けます。
```KQL
SecurityAlert
| summarize Count = count() by AlertSeverity
| order by Count desc, AlertSeverity asc
| project Value = AlertSeverity, Label = strcat(AlertSeverity, ' - ', Count)
```
16.  **[時間の範囲]** ドロップダウン メニューで **TimeRange** を選択します。
17. **[ドロップダウンに含める]** を下にスクロールし、**[すべて]** をオンにし、**[既定で選択されている項目]** を **[すべて]** に設定します。
18. **[保存]** を選択します。
19. **[パラメーターの追加]** を選び、次の情報を入力します。
 - **パラメーター名:** ProductName
 - **パラメーターの種類:** ドロップダウン
20. 次の設定を確認してください。
 - **必須**
 - **Allow multiple selections (複数選択を許可する)**
 - **Hide parameter in reading mode (閲覧モードでパラメーターを非表示にする)**
21. Log Analytics ワークスペースの **[ログ クエリ]** で、以下を貼り付けます。
```KQL
SecurityAlert
| summarize Count = count() by ProductName
| order by Count desc, ProductName asc
| project Value = ProductName, Label = strcat(ProductName, ' - ', Count)
```
22.  **[時間の範囲]** ドロップダウン メニューで **[TimeRange]** を選択します。
23. **[ドロップダウンに含める]** を下にスクロールし、**[すべて]** をオンにし、**[既定で選択されている項目]** を **[すべて]** に設定します。
24. **[保存]** を選択します。
25. **[追加]**、**[クエリの追加]** の順に選択します。
26. Log Analytics ワークスペースの **[ログ クエリ]** で、以下を貼り付けます。
```KQL
SecurityIncident
| where CreatedTime {TimeRange:value}
| summarize arg_max(TimeGenerated,*) by tostring(IncidentNumber)
| extend IncidentID = IncidentName
| extend Alerts = extract("\\[(.*?)\\]", 1, tostring(AlertIds))
| mv-expand AlertIds to typeof(string)
| join
(
    SecurityAlert
    | extend AlertEntities = parse_json(Entities)
    | mv-expand AlertEntities
) on $left.AlertIds == $right.SystemAlertId
| summarize AlertCount=dcount(AlertIds) by IncidentNumber, Status, Severity, Title, Alerts, IncidentUrl, IncidentID
| project IncidentNumber, IncidentID, Title, Severity, Status, AlertCount, Alerts, IncidentUrl
| order by Severity
```
27. [時間範囲] ドロップダウン メニューで **[TimeRange]** を選びます。
選択したインシデントのすべてのアラートを取得するように、動的コンテンツをセットアップします。 アラートはエクスポートされ、このクエリの外部で使用できます。 
28.  **[クエリの編集]** ウィンドウの上部にある **[詳細設定]** タブを選択します。
29. 次の設定を確認してください。
- **[項目が選択されている場合、パラメーターをエクスポートする]** 
30.  **[パラメーターの追加]** を選び、次の情報を入力します。
   - **エクスポートするフィールド**: アラート
   - **パラメーター名**: Alerts
31.  **[保存]** を選択します。 
32. **[設定]** タブに戻ります。
33. **[クエリの実行]** を選択します。
34. **[列の設定]** を選択します。
35. **[IncidentUrl]** を選択します。
36. 列レンダラーを**リンク**に設定します。
37. [リンク設定] で **[開くビュー]** を **Url** に設定します。
38. **保存して閉じる** を選択します。

選択したインシデントに基づいて、アラート ビューを作成します。 

39. **[クエリ項目の編集]** ウィンドウの下部にある **[+ 追加]** を選択します。 **[クエリの追加]** を選択します。
40. Log Analytics ワークスペースのログ クエリに KQL を貼り付ける 
```KQL
SecurityAlert
| where SystemAlertId in ({Alerts})
| summarize by  DisplayName, StartTime, EndTime,  SystemAlertId
| sort by EndTime desc
```
41. [時間範囲] ドロップダウンで **[TimeRange]** を選びます。
42. **[編集完了]** を選択します。
43. **[新しいブック]** ウィンドウの上部のバーで **[編集が完了しました]** を選択します。
44. **[インシデント]** を選択します。
45. リンクされたインシデントに対するアラートが以下に表示されます。

インシデントとそれに関連するアラートのカスタム ビューを含んだダッシュボードが正常に作成されました。
